LEXICON: dict[str, str] = {
    "/help": "Цей бот створений для покращення роботи з "
             "клієнтсьокю базою у кур'єрів.\n\nСюди можна зберігати "
             "інформацію про клієнтів та переглядати уже збережену\n"
             "Клієнти поділені на 3 групи: \n"
             "- <b>Доставка</b> (клієнти для доставки по місту)\n"
             "- <b>Нова пошта</b> (клієнти яким відправляємо НП)\n"
             "- <b>Автобус</b> (інформація по клієнтах яким"
             "відправляємо посилки автобусом)"
}

LEXICON_COMMANDS: dict[str, str] = {
    "/start": "Щоб розпочати користування ботом",
    "/help": "Довідка по роботі з ботом",
    "/cancel": "Відмітини дію"
}

MAIN_LEXICON: list[str] = [
    "Додати клієнта",
    "Переглянути дані клієнта",
    "Редагувати дані клієнта",
    "Видалити клієнта"
]

CHOICE_LEXICON: dict[str, str] = {
    "delivery": "Доставка",
    "NP": "Нова пошта",
    "buss": "Автобус"
}

SET_LEXICON: dict[str, str] = {
    "set_name": "Введіть прізвище та ім'я клієнта 👩‍⚕️ "
                "Якщо знаєте і по-батькові, то також",
    "set_city": "Вкажіть назву населеного пункту, в який їде передача 🏙️",
    "set_phone": "Введіть номер телефону 📲",
    "set_department": "Вкажіть на яке відділення будемо "
                      "відправляти передачу 📦 :",
    "set_address": "Вкажіть адресу та назву салону "
                   "чи клініки 🏢",
    "set_delivery_end_choice": "➕Бажаєте додати більше "
                               "інформації про клієнта? \n"
                               "✔️Чи завершити створення клієнта?",
    "set_delivery_comment": "Введіть коментар для цього клієнта, "
                            "наприклад: код домофону 📟, поверх 🏬 чи "
                            "інші особливості, які можуть допомогти.",
    "set_photo": "Пришліть мені фото яке ви хочете додати. 📷"
}

INVALID_LEXICON: dict[str, str] = {
    "invalid_name": "❌ Щось не так\n"
                    "Введіть ім'я прізвище "
                    "(та по-батькові, якщо знаєте)."
                    "Вони мають містити більше, ніж 3 букви, "
                    "та не містити цифр та інших знаків."
                    "А ви прислали: \n",
    "invalid_phone": "❌ Щось не так\n"
                     "Введіть номер телефону клієнта."
                     "Це має бути 10 чисел.\n"
                     "Наприклад: 0995645777\n"
                     "А ви прислали: \n",
    "invalid_city": "❌ Щось не так\n"
                    "Місто має складатися тільки з букв,"
                    "наприклад: Коломия\n"
                    "А ви прислали: \n",
    "invalid_department": "❌ Щось не так\n"
                          "Відділення Нової пошти повинне складатися "
                          "з цифр і не містити інших символів.\n"
                          "А ви прислали:\n",
    "invalid_address": "❌ Адреса має бути вказана обов'язково!",
    "user_not_found": "❌ Такого клієнта не знайдено.\n"
                      "Перевірте правильність імені та прізвища."
                      "\n\n/cancel - Щоб відмінити дію."
}

DELEVERY_CHOICE: dict[str, str] = {
    "add_phone": "Номер телефону",
    "add_comment": "Додати коментар",
    "add_photo": "Додати фотографію",
    "add_location": "Додати геолокацію",
    "finish": "Завершити"
}

DB_ROWS: dict[str, str] = {
    "name": "👩‍⚕️",
    "phone": "📲",
    "city": "🏢",
    "department": "📦",
    "comment": "📓"
}


UPDATE_USER_LEXICON: dict[dict[str, str]] = {
    "np_choice": {
        "name": "Прізвище Ім'я",
        "phone": "Номер телефону",
        "city": "Місто",
        "department": "Відділення Нової пошти"
    },
    "buss_choice": {
        "name": "Прізвище, Ім'я",
        "phone": "Номер телефону",
        "city": "Місто"
    },
    "delivery_choice": {
        "name": "Прізвище, Ім'я",
        "phone": "Номер телефону",
        "city": "Місто",
        "comment": "Коментар",
        "photo": "Фотографія",
        "location": "Локація"
    }
}

NEW_USER_LEXICON: dict[str, str] = {
    "unknown_user": "Робота з ботом для "
                    "незареєстрованих клієнтів заборонена, "
                    "щоб зареєструватися натисніть на кнопку "
                    "подати заявку (це може зайняти деякий час).",
    "accept_user": "Вітаю 😃\nВас успішно прийнято 👌💪💪\n"
                   "Щоб розпочати роботу натисніть - /start",
    "denial_to_the_user": "❌ ❌ ❌ ❌ ❌ ❌ ❌\n"
                          "Вам відмовлено в доступі\n"
                          "до цього бота",
    "new_user": "Щоб подати заявку\n на роботу з цим "
                "ботом/n натисніть - /start"
}
